import RouteNav from "../../components/routeNav";
import banner from "../../image/notice.png";
import styles from "./newsStyles/routeNotice.module.css";
import NoticeContent from "./noticeContent";

export default function RouteNotice() {
  return (
    <>
      <div className={styles.noticeContainer}>
        <img src={banner} className={styles.banner} width="100%" />
        <RouteNav nav={"행사소식"} current={"공지사항"} />
        <div className={styles.notice}>
          <h1 className={styles.title}>공지사항</h1>
          <NoticeContent
            title={"1번 공지사항입니다."}
            body={
              "공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다.공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다공지사항입니다"
            }
            containerHeight="440px"
          />
          <NoticeContent
            title={"장소 변경 공지입니다."}
            body={"서울에서 시작합니다."}
            containerHeight="100px"
          />
          <NoticeContent
            title={"시간 변경 공지입니다."}
            body={"시간은 7:10 시작입니다."}
            containerHeight="100px"
          />
          <NoticeContent
            title={"촬영 협조건에 대하여"}
            body={"잘 부탁드립니다."}
            containerHeight="100px"
          />
          <NoticeContent
            title={"5번 공지사항입니다."}
            body={"공지사항을 읽어주세요"}
            containerHeight="100px"
          />
          <NoticeContent
            title={"참가하시기 전에 필독"}
            body={"꼭 읽어주세요"}
            containerHeight="100px"
          />
          <NoticeContent
            title={"안녕하신가요"}
            body={"반갑습니다."}
            containerHeight="100px"
          />
        </div>
      </div>
    </>
  );
}
